&НаКлиенте
Процедура ПродажаАбонементовАбонементПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПродажаАбонементов.ТекущиеДанные;
	СтрокаТабличнойЧасти.Цена = РаботаСРегистрами.РозничнаяЦенаАбонементов(Объект.Дата,СтрокаТабличнойЧасти.Абонемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ПродажаАбонементовПриИзменении(Элемент)
	Объект.СуммаДокумента = Объект.ПродажаАбонементов.Итог("Цена");
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКОплате(Команда)
	
	ДокументЗаписан = Ложь;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ПараметрыЗаписи = Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение);
		ДокументЗаписан = Записать(ПараметрыЗаписи);
	Иначе
		ДокументЗаписан = Истина;
		
	КонецЕсли;
	
	Если ДокументЗаписан Тогда
		СтруктураПараметров = Новый Структура("Основание", Объект.Ссылка);
		ОткрытьФорму("Документ.ОплатаУслугИАбонементов.ФормаОбъекта", СтруктураПараметров,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	КонецЕсли;
	
КонецПроцедуры
