
#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПрочитатьCSV(Команда)
	
	ПараметрыПомещения = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыПомещения.Фильтр = "Файл CSV|*.csv";
	
	Результат = Ждать ПоместитьФайлНаСерверАсинх(,,, ПараметрыПомещения);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.ПомещениеФайлаОтменено Тогда
		Возврат;
	КонецЕсли;
	
	ПрочитатьФайлCSV(Результат.Адрес);
	
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьФайлCSV(Адрес)
	
	НачалоЗамера = ТекущаяУниверсальнаяДатаВМиллисекундах();
	
	ДанныеФайла = ПолучитьИзВременногоХранилища(Адрес);
	
	Чтение = Новый ЧтениеТекста(ДанныеФайла.ОткрытьПотокДляЧтения());
	
	НомерСтроки = 1;
	Разделитель = ";";
	
	Пока Истина Цикл
		
		Строка = Чтение.ПрочитатьСтроку();
		
		Если Строка = Неопределено Тогда
			Прервать;
		КонецЕсли;
		
//		ПрочитатьСтроку(Строка, НомерСтроки, Разделитель);
		Данные = ПрочитатьСтроку(Строка, РегулярноеВыражение(Разделитель));
		
		Для НомерКолонки = 0 По Данные.Количество() - 1 Цикл
			ТабличныйДокумент.Область(НомерСтроки, НомерКолонки + 1).Текст = Данные[НомерКолонки];
		КонецЦикла;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Чтение.Закрыть();
	
	ВремяРаботы = ТекущаяУниверсальнаяДатаВМиллисекундах() - НачалоЗамера;
	
	Сообщить("Время работы: " + ВремяРаботы / 1000 + "сек.")
	
КонецПроцедуры

&НаСервере
//Процедура ПрочитатьСтроку(Строка, НомерСтроки, Разделитель)
//		
//		ИдетЧтение = Ложь;
//		ЧтениеСтрокиВКовычках = Ложь;
//		ПрочитанаПерваяКовычка = Ложь;
//		Буфер = Новый Массив;
//		
//		НомерКолонки = 1;
//		
//		Для НомерПозиции = 1 По СтрДлина(Строка) Цикл
//			
//			 Символ = Сред(Строка, НомерПозиции, 1);
//			 
//			 Если Символ = """" Тогда
//				 
//				Если Не ИдетЧтение Тогда
//					ИдетЧтение = Истина;
//					ЧтениеСтрокиВКовычках = Истина;
//					Продолжить;			 
//				КонецЕсли;
//				 
//				Если ПрочитанаПерваяКовычка Тогда
//					Буфер.Добавить(Символ);
//					ПрочитанаПерваяКовычка = Ложь;
//				Иначе
//					ПрочитанаПерваяКовычка = Истина;
//				КонецЕсли;
//				
//			ИначеЕсли  Символ = Разделитель Тогда
//				
//				Если Не ЧтениеСтрокиВКовычках Тогда	
//					ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст = СтрСоединить(Буфер);
//				    НомерКолонки = НомерКолонки + 1;
//				    ИдетЧтение = Ложь;
//					Буфер.Очистить();
//					Продолжить;
//				Иначе
//					Если ПрочитанаПерваяКовычка Тогда
//						ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст = СтрСоединить(Буфер);
//				    	НомерКолонки = НомерКолонки + 1;
//				    	ИдетЧтение = Ложь;
//						ПрочитанаПерваяКовычка = Ложь;
//						ЧтениеСтрокиВКовычках = Ложь;
//						Буфер.Очистить();
//						Продолжить;
//					Иначе
//						Буфер.Добавить(Символ);
//					КонецЕсли;					
//				КонецЕсли;
//			Иначе
//				Буфер.Добавить(Символ);
//				ИдетЧтение = Истина;
//				ПрочитанаПерваяКовычка = Ложь;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		Если ЗначениеЗаполнено(Буфер) Тогда
//			ТабличныйДокумент.Область(НомерСтроки, НомерКолонки).Текст = СтрСоединить(Буфер);
//		КонецЕсли;
//	
//КонецПроцедуры

Функция РегулярноеВыражение(Разделитель)
	
	//Шаблон = "(?:%1""|^"")(""|[\w\W]*?)(?=""%1|""$)|(?:%1(?!"")|^(?!""))([^%1]*?)(?=$|%1)|(\r\n|\n)" ;   
	Шаблон = "(?:(?<=%1)|^)(?:""([^""]*(?:""""[^""]*)*)""|([^""%1]*))";
	
	Возврат СтрШаблон(Шаблон, Разделитель);
	
КонецФункции

&НаСервере
Функция ПрочитатьСтроку(Строка, РегулярноеВыражение)
	
	МассивРезультатов = СтрНайтиВсеПоРегулярномуВыражению(Строка, РегулярноеВыражение, Истина);  
	Массив = Новый Массив;
	
	Для каждого Результат Из МассивРезультатов Цикл 
		
		Значение = Результат.Значение; 
		Длина = Результат.Длина;
		
		Если СтрНачинаетсяС(Значение, """") Тогда  
			Значение = Прав(Значение, Длина - 1);  
			Длина = Длина - 1;
		КонецЕсли; 
		
		Если СтрЗаканчиваетсяНа(Значение, """") Тогда  
			Значение = Лев(Значение, Длина - 1);
		КонецЕсли;  
		
		Значение = СтрЗаменить(Значение, """""", """");
		
		Массив.Добавить(Значение);
		
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции
#КонецОбласти