
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РеализацияТоваров)
	ТабДок = Новый ТабличныйДокумент;
	РеализацияТоваров(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура РеализацияТоваров(ТабДок, ПараметрКоманды)
	Документы.РеализацияТоваров.РеализацияТоваров(ТабДок, ПараметрКоманды);
КонецПроцедуры
