&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьПользователяИБ(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты) 
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторПользователяИБ)
		Или ВходРазрешен Тогда
		
		Если ПустаяСтрока(Логин) Тогда
			Отказ = Истина;
			
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Необходимо заполнить логин";
			Сообщение.Поле = "Логин";
			Сообщение.Сообщить();
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьПользователяИБ(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		ПользовательИБСоздан = Истина;
	Иначе
		ПользовательИБСоздан = Ложь;
	КонецЕсли;
	
	Если НЕ ПользовательИБСоздан И НЕ ВходРазрешен Тогда;
		Возврат;
	КонецЕсли;
	
	Если НЕ ПользовательИБСоздан Тогда;
		ПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
	Иначе
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
        	ТекущийОбъект.ИдентификаторПользователяИБ);
			
		КонецЕсли;
		
	ПользовательИБ.ПолноеИмя = ТекущийОбъект.Наименование;
	ПользовательИБ.Имя = Логин;
	ПользовательИБ.АутентификацияСтандартная = ВходРазрешен;
	
	Если ПарольИзменен Тогда
		ПользовательИБ.Пароль = Пароль;
	КонецЕсли;	
	
	ЗаполнитьРолиПользователяИБ(ТекущийОбъект, ПользовательИБ);
		
	ПользовательИБ.Записать();
	
	ТекущийОбъект.ИдентификаторПользователяИБ = ПользовательИБ.УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРолиПользователяИБ(ТекущийОбъект, ПользовательИБ)
	
	ПользовательИБ.Роли.Очистить();
	
	Если ТекущийОбъект.Администратор Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.ПолныеПрава);
	КонецЕсли;
	
	Если ТекущийОбъект.МенеджерПоПоступлениям Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.МенеджерПоПоступлениям);
	КонецЕсли;
			
	Если ТекущийОбъект.МенеджерПоПродажамТоваров Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.МенеджерПоПродажамТоваров);
	КонецЕсли;
	
	Если ТекущийОбъект.МенеджерПоПродажамУслугИАбонементов Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.МенеджерПоПродажамУслугиИАбонементов);
	КонецЕсли;
	
	Если ТекущийОбъект.Тренер Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Тренер);
	КонецЕсли;
	
	Если ТекущийОбъект.Директор Тогда;
		ПользовательИБ.Роли.Добавить(Метаданные.Роли.Директор);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ИдентификаторПользователяИБ) Тогда
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(
        	ТекущийОбъект.ИдентификаторПользователяИБ);
			
		ВходРазрешен = ПользовательИБ.АутентификацияСтандартная;
		Логин = ПользовательИБ.Имя;
		
		Если ЗначениеЗаполнено(ПользовательИБ.СохраняемоеЗначениеПароля) Тогда
			Пароль = Новый УникальныйИдентификатор;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПарольПриИзменении(Элемент)
	
	ПарольИзменен = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсторияЗаписей(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = "РегистрСведений.ИсторияЗаписей.ФормаСписка";
	СтруктураОтбора = Новый Структура("Тренер", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора); 
	ОткрытьФорму(ИмяОткрываемойФормы,СтруктураПараметров,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура ДопДанные(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = "РегистрСведений.ДопДанныеОСотрудниках.ФормаСписка";
	СтруктураОтбора = Новый Структура("Сотрудник", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора); 
	ОткрытьФорму(ИмяОткрываемойФормы,СтруктураПараметров,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры

&НаКлиенте
Процедура Квалификация(Команда)
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяОткрываемойФормы = "РегистрСведений.КвалификацияСотрудников.ФормаСписка";
	СтруктураОтбора = Новый Структура("Сотрудник", Объект.Ссылка);
	СтруктураПараметров = Новый Структура("Отбор", СтруктураОтбора); 
	ОткрытьФорму(ИмяОткрываемойФормы,СтруктураПараметров,ЭтотОбъект,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры






