Процедура РеализацияТоваров(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РеализацияТоваров)
	Макет = Документы.РеализацияТоваров.ПолучитьМакет("РеализацияТоваров");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваров.Дата,
	|	РеализацияТоваров.Номер,
	|	РеализацияТоваров.Склад,
	|	РеализацияТоваров.СуммаДокумента,
	|	РеализацияТоваров.ПроданныеТовары.(
	|		НомерСтроки,
	|		Товар,
	|		Количество,
	|		Цена,
	|		Сумма
	|	)
	|ИЗ
	|	Документ.РеализацияТоваров КАК РеализацияТоваров
	|ГДЕ
	|	РеализацияТоваров.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПроданныеТоварыШапка = Макет.ПолучитьОбласть("ПроданныеТоварыШапка");
	ОбластьПроданныеТовары = Макет.ПолучитьОбласть("ПроданныеТовары");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D"));
		ЗначенияПараметров.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
		ЗначенияПараметров.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ЗначенияПараметров.Вставить("Склад", Выборка.Склад);
		ЗначенияПараметров.Вставить("СуммаПрописью", СуммаПрописью(Выборка.СуммаДокумента));
		
		ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(ЗначенияПараметров);				
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПроданныеТоварыШапка);
		ВыборкаПроданныеТовары = Выборка.ПроданныеТовары.Выбрать();
		Пока ВыборкаПроданныеТовары.Следующий() Цикл
			ОбластьПроданныеТовары.Параметры.Заполнить(ВыборкаПроданныеТовары);
			ТабДок.Вывести(ОбластьПроданныеТовары, ВыборкаПроданныеТовары.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция УдалитьЛидирующиеНули(Знач Номер)
	
	Пока СтрНачинаетсяС(Номер, "0") Цикл
		  Номер = Сред(Номер, 2);
	КонецЦикла;
	  
	Возврат Номер;
	
КонецФункции

Функция СуммаПрописью(СуммаДокумента)
	
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
	Возврат ЧислоПрописью(СуммаДокумента,, ПарПредмета);
		
КонецФункции
