
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РеализацияАбонементов)
	ТабДок = Новый ТабличныйДокумент;
	РеализацияАбонементов(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура РеализацияАбонементов(ТабДок, ПараметрКоманды)
	Документы.РеализацияАбонементов.РеализацияАбонементов(ТабДок, ПараметрКоманды);
КонецПроцедуры
