Процедура РеализацияАбонементов(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(РеализацияАбонементов)
	Макет = Документы.РеализацияАбонементов.ПолучитьМакет("РеализацияАбонементов");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияАбонементов.Дата,
	|	РеализацияАбонементов.Клиент,
	|	РеализацияАбонементов.Номер,
	|	РеализацияАбонементов.СрокДействия,
	|	РеализацияАбонементов.Статус,
	|	РеализацияАбонементов.СуммаДокумента,
	|	РеализацияАбонементов.ПродажаАбонементов.(
	|		НомерСтроки,
	|		Абонемент,
	|		Цена
	|	)
	|ИЗ
	|	Документ.РеализацияАбонементов КАК РеализацияАбонементов
	|ГДЕ
	|	РеализацияАбонементов.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьПродажаАбонементовШапка = Макет.ПолучитьОбласть("ПродажаАбонементовШапка");
	ОбластьПродажаАбонементов = Макет.ПолучитьОбласть("ПродажаАбонементов");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("Клиент", Выборка.Клиент);
		ЗначенияПараметров.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D"));
		ЗначенияПараметров.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
		ЗначенияПараметров.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ЗначенияПараметров.Вставить("СуммаПрописью", СуммаПрописью(Выборка.СуммаДокумента));
		ЗначенияПараметров.Вставить("Статус", Выборка.Статус);
		ЗначенияПараметров.Вставить("СрокДействия", Выборка.СрокДействия);
		
		ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(ЗначенияПараметров);				
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьПродажаАбонементовШапка);
		ВыборкаПродажаАбонементов = Выборка.ПродажаАбонементов.Выбрать();
		Пока ВыборкаПродажаАбонементов.Следующий() Цикл
			ОбластьПродажаАбонементов.Параметры.Заполнить(ВыборкаПродажаАбонементов);
			ТабДок.Вывести(ОбластьПродажаАбонементов, ВыборкаПродажаАбонементов.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция УдалитьЛидирующиеНули(Знач Номер)
	
	Пока СтрНачинаетсяС(Номер, "0") Цикл
		  Номер = Сред(Номер, 2);
	КонецЦикла;
	  
	Возврат Номер;
	
КонецФункции

Функция СуммаПрописью(СуммаДокумента)
	
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
	Возврат ЧислоПрописью(СуммаДокумента,, ПарПредмета);
		
КонецФункции
