Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Клиенты") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Наименование;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаАбонементов 
	Движения.ПродажаАбонементов.Записывать = Истина;
	Для Каждого ТекСтрокаПродажаАбонементов Из ПродажаАбонементов Цикл
		Движение = Движения.ПродажаАбонементов.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Абонемент = ТекСтрокаПродажаАбонементов.Абонемент;
		Движение.Цена = ТекСтрокаПродажаАбонементов.Цена;
	КонецЦикла;

	// регистр ДеньгиОтПродажиУслугИАбонементов Приход
	Движения.ДеньгиОтПродажиУслугИАбонементов.Записывать = Истина;
	Движение = Движения.ДеньгиОтПродажиУслугИАбонементов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(ТипОплаты);
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Функция ТипДенежныхСредствПоСпособуОплаты(ТипОплаты)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.Оплата.Наличные, Перечисления.ТипДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.Оплата.Карта, Перечисления.ТипДенежныхСредств.Безналичные);
	
	
	Возврат Соответствие[ТипОплаты];
КонецФункции

