Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаПоставкаТоваров Из ПоставкаТоваров Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаПоставкаТоваров.Товар;
		Движение.Склад = Склад;
		Движение.Количество = ТекСтрокаПоставкаТоваров.Количество;
	КонецЦикла;

	// регистр ИсторияПоставочныхЦен
	Движения.ИсторияПоставочныхЦен.Записывать = Истина;
	Для Каждого ТекСтрокаПоставкаТоваров Из ПоставкаТоваров Цикл
		Движение = Движения.ИсторияПоставочныхЦен.Добавить();
		Движение.Период = Дата;
		Движение.Поставщик = Поставщик;
		Движение.Товар = ТекСтрокаПоставкаТоваров.Товар;
		Движение.Количество = ТекСтрокаПоставкаТоваров.Количество;
		Движение.Цена = ТекСтрокаПоставкаТоваров.Цена;
		Движение.Сумма = ТекСтрокаПоставкаТоваров.Сумма;
	КонецЦикла;

	КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры 

Процедура ПриКопировании(ОбъектКопирования)
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры


