
Процедура ЗаписьКлиента(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаписьКлиента)
	Макет = Документы.ЗаписьКлиента.ПолучитьМакет("ЗаписьКлиента");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаписьКлиента.Дата,
	|	ЗаписьКлиента.Клиент,
	|	ЗаписьКлиента.Номер,
	|	ЗаписьКлиента.СуммаДокумента,
	|	ЗаписьКлиента.Тренер,
	|	ЗаписьКлиента.ОказываемыеУслуги.(
	|		НомерСтроки,
	|		Услуга,
	|		Цена
	|	)
	|ИЗ
	|	Документ.ЗаписьКлиента КАК ЗаписьКлиента
	|ГДЕ
	|	ЗаписьКлиента.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьОказываемыеУслугиШапка = Макет.ПолучитьОбласть("ОказываемыеУслугиШапка");
	ОбластьОказываемыеУслуги = Макет.ПолучитьОбласть("ОказываемыеУслуги");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		
		ЗначенияПараметров = Новый Структура;
		ЗначенияПараметров.Вставить("Клиент", Выборка.Клиент);
		ЗначенияПараметров.Вставить("Тренер", Выборка.Тренер);
		ЗначенияПараметров.Вставить("Дата", Формат(Выборка.Дата, "ДЛФ=D"));
		ЗначенияПараметров.Вставить("Номер", УдалитьЛидирующиеНули(Выборка.Номер));
		ЗначенияПараметров.Вставить("СуммаДокумента", Выборка.СуммаДокумента);
		ЗначенияПараметров.Вставить("СуммаПрописью", СуммаПрописью(Выборка.СуммаДокумента));
		
		ОбластьЗаголовок.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(ЗначенияПараметров);				
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьОказываемыеУслугиШапка);
		ВыборкаОказываемыеУслуги = Выборка.ОказываемыеУслуги.Выбрать();
		Пока ВыборкаОказываемыеУслуги.Следующий() Цикл
			ОбластьОказываемыеУслуги.Параметры.Заполнить(ВыборкаОказываемыеУслуги);
			ТабДок.Вывести(ОбластьОказываемыеУслуги, ВыборкаОказываемыеУслуги.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(ЗначенияПараметров);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры

Функция УдалитьЛидирующиеНули(Знач Номер)
	
	Пока СтрНачинаетсяС(Номер, "0") Цикл
		  Номер = Сред(Номер, 2);
	КонецЦикла;
	  
	Возврат Номер;
	
КонецФункции

Функция СуммаПрописью(СуммаДокумента)
	
	ПарПредмета="рубль,рубля,рублей,м,копейка,копейки,копеек,ж,2";
	Возврат ЧислоПрописью(СуммаДокумента,, ПарПредмета);
		
КонецФункции