Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ПродажаУслуг 
	Движения.ПродажаУслуг.Записывать = Истина;
	Для Каждого ТекСтрокаОказываемыеУслуги Из ОказываемыеУслуги Цикл
		Движение = Движения.ПродажаУслуг.Добавить();
		Движение.Период = Дата;
		Движение.Клиент = Клиент;
		Движение.Услуга = ТекСтрокаОказываемыеУслуги.Услуга;
		Движение.Тренер = Тренер;
		Движение.Цена = ТекСтрокаОказываемыеУслуги.Цена;
	КонецЦикла;

	// регистр ДеньгиОтПродажиУслугИАбонементов Приход
	Движения.ДеньгиОтПродажиУслугИАбонементов.Записывать = Истина;
	Движение = Движения.ДеньгиОтПродажиУслугИАбонементов.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(ТипОплаты);
	Движение.Сумма = СуммаДокумента;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаписьКлиента") Тогда
		// Заполнение шапки
		Клиент = ДанныеЗаполнения.Клиент;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Запись = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ДанныеЗаполнения.СуммаДокумента;
		Тренер = ДанныеЗаполнения.Тренер;
		Для Каждого ТекСтрокаОказываемыеУслуги Из ДанныеЗаполнения.ОказываемыеУслуги Цикл
			НоваяСтрока = ОказываемыеУслуги.Добавить();
			НоваяСтрока.Услуга = ТекСтрокаОказываемыеУслуги.Услуга;
			НоваяСтрока.Цена = ТекСтрокаОказываемыеУслуги.Цена;
		КонецЦикла;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	
	Ответственный = ПараметрыСеанса.ТекущийСотрудник;
КонецПроцедуры

Функция ТипДенежныхСредствПоСпособуОплаты(ТипОплаты)
	
	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.Оплата.Наличные, Перечисления.ТипДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.Оплата.Карта, Перечисления.ТипДенежныхСредств.Безналичные);
	
	
	Возврат Соответствие[ТипОплаты];
КонецФункции


