
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ЗаписьКлиента)
	ТабДок = Новый ТабличныйДокумент;
	ЗаписьКлиента(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ЗаписьКлиента(ТабДок, ПараметрКоманды)
	Документы.ЗаписьКлиента.ЗаписьКлиента(ТабДок, ПараметрКоманды);
КонецПроцедуры
