&НаКлиенте
Процедура ПоставкаТоваровКоличествоПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПоставкаТоваров.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоставкаТоваровЦенаПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.ПоставкаТоваров.ТекущиеДанные;
	РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);

КонецПроцедуры

&НаКлиенте
Процедура ПоставкаТоваровПриИзменении(Элемент)
	
	Объект.СуммаДокумента = Объект.ПоставкаТоваров.Итог("Сумма");
	
КонецПроцедуры
